MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
/**
  PWM Generated Driver API Header File

  @Company
    Microchip Technology Inc.

  @File Name
    pwm.h

  @Summary
    This is the generated header file for the PWM driver using PIC24 / dsPIC33 / PIC32MM MCUs

  @Description
    This header file provides APIs for driver for PWM.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.171.1
        Device            :  dsPIC33EP128GS806
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.70
        MPLAB 	          :  MPLAB X v5.50
*/

/*
    (c) 2020 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

#ifndef _PWM_H
#define _PWM_H

/**
  Section: Included Files
*/

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>

#ifdef __cplusplus  // Provide C++ Compatibility

    extern "C" {

#endif

/**
  Section: Data Types
*/
/** PWM Driver Specific Macro Definition
 
 @Summary 
   Defines the PWM driver specific macro definitions.
 
 @Description
   This routine defines the PWM driver specific macro definitions.
 
 Remarks:
   None
 */
#define PWM_OVERRIDE_DATA_MASK                  0x00c0
#define PWM_OVERRIDE_DATA_POSITION              6
#define PWM_OVERRIDE_DATA_HIGH_MASK             0x0080
#define PWM_OVERRIDE_DATA_HIGH_POSITION         7
#define PWM_OVERRIDE_DATA_LOW_MASK              0x0040
#define PWM_OVERRIDE_DATA_LOW_POSITION          6
#define PWM_OVERRIDE_HIGH_MASK                  0x0200
#define PWM_OVERRIDE_LOW_MASK                   0x0100
#define PWM_FAULT_LATCH_MASK                    0x0003
#define PWM_FAULT_LATCH_POSITION                0
#define PWM_FAULT_LATCH_ENABLE_VALUE            0x0000
#define PWM_FAULT_LATCH_DISABLE_VALUE           0x0011

/** PWM Generator Definition
 
 @Summary 
   Defines the PWM generators available for PWM
 
 @Description
   This routine defines the PWM generators that are available for the module to use.
 
 Remarks:
   None
 */
typedef enum 
{
    PWM_GENERATOR_1 =  1,       
    PWM_GENERATOR_2 =  2,       
    PWM_GENERATOR_3 =  3,       
    PWM_GENERATOR_4 =  4,       
    PWM_GENERATOR_5 =  5,       
    PWM_GENERATOR_6 =  6,       
    PWM_GENERATOR_7 =  7,       
    PWM_GENERATOR_8 =  8,       
} PWM_GENERATOR;

/** PWM Generator Interrupt Definition
 
 @Summary 
   Defines the PWM generator interrupt available for PWM
 
 @Description
   This routine defines the PWM generator interrupt that are available for the module to use.
 
 Remarks:
   None
 */
typedef enum 
{
    PWM_GENERATOR_INTERRUPT_FAULT =  1,       
    PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT =  2,
    PWM_GENERATOR_INTERRUPT_TRIGGER =  3,	
} PWM_GENERATOR_INTERRUPT;

/**
  Section: Interface Routines
*/

/**
  @Summary
    Initializes PWM module.

  @Description
    This routine initializes PWM module, using the given initialization data. 

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    bool status;
    uint16_t masterPeriod,masterDutyCycle;
    uint16_t compareValue;

    compareValue = 0x1;

    masterPeriod = 0xFFFF;
    masterDutyCycle = 0xFF;


    PWM_Initialize();

    PWM_Disable();

    PWM_MasterDutyCycleSet(masterDutyCycle);
    PWM_MasterPeriodSet(period);

    PWM_SpecialEventPrimaryInterruptDisable();
    PWM_SpecialEventTriggerInterruptFlagClear();
    PWM_SpecialEventPrimaryCompareValueSet(compareValue);
    PWM_SpecialEventPrimaryInterruptEnable();

    PWM_Enable();
    </code>
*/
void PWM_Initialize (void);

/**
  @Summary
    Enables the PWM module.

  @Description
    This routine is used to enable the PWM module.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_Enable();
    </code>
*/
inline static void PWM_Enable(void)
{
	PTCONbits.PTEN = true; 
}

/**
  @Summary
    Disables the PWM module.

  @Description
    This routine is used to disable the PWM module.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_Disable();
    </code>
*/
inline static void PWM_Disable(void)
{
	PTCONbits.PTEN = false; 
}

/**
  @Summary
    Sets the period value in count for the Primary Master Time Base generator.

  @Description
    This routine is used to set the period value in count for the Primary Master Time Base generator.

  @Param
    masterPeriod - Period value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t masterPeriod;

    masterPeriod = 0xFF;
    
    PWM_MasterPeriodSet(masterPeriod);
    </code>
*/
inline static void PWM_MasterPeriodSet(uint16_t masterPeriod)
{
    PTPER = masterPeriod;
}

/**
  @Summary
    Used to set the PWM master duty cycle register.

  @Description
    This routine is used to set the PWM master duty cycle register.

  @Param
    masterDutyCycle - Master Duty Cyle value.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t masterDutyCycle;

    masterDutyCycle = 0xFF;
    
    PWM_MasterDutyCycleSet(masterDutyCycle);
    </code>
*/
inline static void PWM_MasterDutyCycleSet(uint16_t masterDutyCycle)
{
    MDC = masterDutyCycle;
}

/**
  @Summary
    Sets the period value in count for the PWM generator specific Time Base.

  @Description
    This routine is used to set the period value in count for the PWM generator specific Time Base.

  @Param
    genNum  - PWM generator number.
    period  - Period value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t period;

    period = 0xFF;
    
    genNum = PWM_GENERATOR_1;
    PWM_PeriodSet(genNum, period);
    </code>
*/  
inline static void PWM_PeriodSet(PWM_GENERATOR genNum, uint16_t period)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                PHASE1 = period;                
                break;       
        case PWM_GENERATOR_2:
                PHASE2 = period;                
                break;       
        case PWM_GENERATOR_3:
                PHASE3 = period;                
                break;       
        case PWM_GENERATOR_4:
                PHASE4 = period;                
                break;       
        case PWM_GENERATOR_5:
                PHASE5 = period;                
                break;       
        case PWM_GENERATOR_6:
                PHASE6 = period;                
                break;       
        case PWM_GENERATOR_7:
                PHASE7 = period;                
                break;       
        case PWM_GENERATOR_8:
                PHASE8 = period;                
                break;       
        default:break;  
    }
}

/**
  @Summary
    Sets the PWM duty cycle value in count for the PWM Generator.

  @Description
    This routine is used to set the PWM duty cycle value in count for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum      - PWM generator number.
    dutyCycle   - Duty cycle value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t dutyCycle;

    dutyCycle = 0xFF;
    
    genNum = PWM_GENERATOR_1;
    PWM_DutyCycleSet(genNum, dutyCycle);
    </code>
*/  
inline static void PWM_DutyCycleSet(PWM_GENERATOR genNum, uint16_t dutyCycle)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                PDC1 = dutyCycle;                
                break;       
        case PWM_GENERATOR_2:
                PDC2 = dutyCycle;                
                break;       
        case PWM_GENERATOR_3:
                PDC3 = dutyCycle;                
                break;       
        case PWM_GENERATOR_4:
                PDC4 = dutyCycle;                
                break;       
        case PWM_GENERATOR_5:
                PDC5 = dutyCycle;                
                break;       
        case PWM_GENERATOR_6:
                PDC6 = dutyCycle;                
                break;       
        case PWM_GENERATOR_7:
                PDC7 = dutyCycle;                
                break;       
        case PWM_GENERATOR_8:
                PDC8 = dutyCycle;                
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM override data bits with the requested value for the PWM Generator.

  @Description
    This routine is used to updates PWM override data bits with the requested 
    value for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    overrideData    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t overrideData;

    overrideData = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideDataSet(genNum, overrideData);
    </code>
*/  
inline static void PWM_OverrideDataSet(PWM_GENERATOR genNum, uint16_t overrideData)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON1 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON1, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_2:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON2 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON2, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_3:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON3 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON3, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_4:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON4 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON4, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_5:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON5 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON5, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_6:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON6 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON6, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_7:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON7 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON7, overrideData, &PWMKEY); 
                break;       
        case PWM_GENERATOR_8:
                overrideData = ((overrideData & 0x0003)<< PWM_OVERRIDE_DATA_POSITION);
                overrideData = (IOCON8 & (~(PWM_OVERRIDE_DATA_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON8, overrideData, &PWMKEY); 
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM override high data bit with the requested value for the PWM 
    Generator.

  @Description
    This routine is used to update PWM override high data bit with the 
    requested value for the PWM Generator selected by the argument 
    PWM_GENERATOR.

  @Param
    genNum              - PWM generator number.
    overrideDataHigh    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    bool overrideDataHigh;

    overrideDataHigh = true;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideDataHighSet(genNum, overrideDataHigh);
    </code>
*/  
inline static void PWM_OverrideDataHighSet(PWM_GENERATOR genNum, bool overrideDataHigh)
{
    uint16_t overrideData;
    
