MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
    switch(genNum) { 
        case PWM_GENERATOR_1:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON1 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON1, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_2:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON2 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON2, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_3:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON3 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON3, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_4:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON4 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON4, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_5:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON5 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON5, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_6:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON6 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON6, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_7:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON7 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON7, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_8:
                overrideData = (overrideDataHigh << PWM_OVERRIDE_DATA_HIGH_POSITION);
                overrideData = (IOCON8 & (~(PWM_OVERRIDE_DATA_HIGH_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON8, overrideData, &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM override low data bit with the requested value 
    for the PWM Generator.

  @Description
    This routine is used to update PWM override low data bit with the requested 
    value for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum              - PWM generator number.
    overrideDataLow     - Override data

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    bool overrideDataLow;

    overrideDataLow = true;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideDataLowSet(genNum, overrideDataLow);
    </code>
*/  
inline static void PWM_OverrideDataLowSet(PWM_GENERATOR genNum, bool overrideDataLow)
{
    uint16_t overrideData;
    
    switch(genNum) { 
        case PWM_GENERATOR_1:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON1 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON1, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_2:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON2 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON2, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_3:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON3 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON3, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_4:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON4 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON4, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_5:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON5 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON5, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_6:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON6 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON6, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_7:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON7 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON7, overrideData, &PWMKEY);
                break;       
        case PWM_GENERATOR_8:
                overrideData = (overrideDataLow << PWM_OVERRIDE_DATA_LOW_POSITION);
                overrideData = (IOCON8 & (~(PWM_OVERRIDE_DATA_LOW_MASK))) | overrideData;
                __builtin_write_PWMSFR(&IOCON8, overrideData, &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Gets PWM override value for the PWM Generator.

  @Description
    This routine is used to get PWM override value for the PWM Generator 
    selected by the argument PWM_GENERATOR.
	
  @Param
    genNum          - PWM generator number.

  @Returns
    Override data for the PWM Generator selected by the argument PWM_GENERATOR.
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t overrideData;
    
    genNum = PWM_GENERATOR_1;
    overrideData = PWM_OverrideDataGet(genNum, overrideData);
    </code>
*/
inline static uint16_t PWM_OverrideDataGet(PWM_GENERATOR genNum)
{
    uint16_t overrideData;
    switch(genNum) { 
        case PWM_GENERATOR_1:
                overrideData = IOCON1bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_2:
                overrideData = IOCON2bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_3:
                overrideData = IOCON3bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_4:
                overrideData = IOCON4bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_5:
                overrideData = IOCON5bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_6:
                overrideData = IOCON6bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_7:
                overrideData = IOCON7bits.OVRDAT;                 
                break;       
        case PWM_GENERATOR_8:
                overrideData = IOCON8bits.OVRDAT;                 
                break;       
        default:break;  
    }
    return overrideData;
}

/**
  @Summary
    Enables PWM override on PWMH output for the PWM Generator.

  @Description
    This routine is used to enable PWM override on PWMH output for the 
    PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideHighEnable(genNum);
    </code>
*/  
inline static void PWM_OverrideHighEnable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_2:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_3:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_4:
                __builtin_write_PWMSFR(&IOCON4, (IOCON4 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_5:
                __builtin_write_PWMSFR(&IOCON5, (IOCON5 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_6:
                __builtin_write_PWMSFR(&IOCON6, (IOCON6 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_7:
                __builtin_write_PWMSFR(&IOCON7, (IOCON7 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        case PWM_GENERATOR_8:
                __builtin_write_PWMSFR(&IOCON8, (IOCON8 | (PWM_OVERRIDE_HIGH_MASK)), &PWMKEY); 
                break;       
        default:break;  
    }
}

/**
  @Summary
    Enables PWM override on PWML output for the PWM Generator.

  @Description
    This routine is used to enable PWM override on PWML output for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideLowEnable(genNum);
    </code>
*/  
inline static void PWM_OverrideLowEnable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_2:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_3:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_4:
                __builtin_write_PWMSFR(&IOCON4, (IOCON4 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_5:
                __builtin_write_PWMSFR(&IOCON5, (IOCON5 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_6:
                __builtin_write_PWMSFR(&IOCON6, (IOCON6 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_7:
                __builtin_write_PWMSFR(&IOCON7, (IOCON7 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        case PWM_GENERATOR_8:
                __builtin_write_PWMSFR(&IOCON8, (IOCON8 | (PWM_OVERRIDE_LOW_MASK)), &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Disables PWM override on PWMH output for the PWM Generator.

  @Description
    This routine is used to disable PWM override on PWMH output for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideHighDisable(genNum);
    </code>
*/  
inline static void PWM_OverrideHighDisable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_2:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_3:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_4:
                __builtin_write_PWMSFR(&IOCON4, (IOCON4 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_5:
                __builtin_write_PWMSFR(&IOCON5, (IOCON5 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_6:
                __builtin_write_PWMSFR(&IOCON6, (IOCON6 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_7:
                __builtin_write_PWMSFR(&IOCON7, (IOCON7 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_8:
                __builtin_write_PWMSFR(&IOCON8, (IOCON8 & (~(PWM_OVERRIDE_HIGH_MASK))), &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Disables PWM override on PWML output for the PWM Generator.

  @Description
    This routine is used to disable PWM override on PWML output for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_OverrideLowDisable(genNum);
    </code>
*/  
inline static void PWM_OverrideLowDisable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                __builtin_write_PWMSFR(&IOCON1, (IOCON1 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_2:
                __builtin_write_PWMSFR(&IOCON2, (IOCON2 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_3:
                __builtin_write_PWMSFR(&IOCON3, (IOCON3 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_4:
                __builtin_write_PWMSFR(&IOCON4, (IOCON4 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_5:
                __builtin_write_PWMSFR(&IOCON5, (IOCON5 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_6:
                __builtin_write_PWMSFR(&IOCON6, (IOCON6 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_7:
                __builtin_write_PWMSFR(&IOCON7, (IOCON7 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        case PWM_GENERATOR_8:
                __builtin_write_PWMSFR(&IOCON8, (IOCON8 & (~(PWM_OVERRIDE_LOW_MASK))), &PWMKEY);
                break;       
        default:break;  
    }
}

/**
  @Summary
    Updates PWM Deadtime low register with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM Deadtime low register with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum      - PWM generator number.
    deadtimeLow - Deadtime low value.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t deadtimeLow;

    deadtimeLow = 0x01;
    
    PWM_DeadTimeLowSet(PWM_GENERATOR_1, deadtimeLow);
    </code>
*/  
inline static void PWM_DeadTimeLowSet(PWM_GENERATOR genNum, uint16_t deadtimeLow)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                DTR1 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_2:
                DTR2 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_3:
                DTR3 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_4:
                DTR4 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_5:
                DTR5 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_6:
                DTR6 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_7:
                DTR7 = deadtimeLow;                
                break;          
        case PWM_GENERATOR_8:
                DTR8 = deadtimeLow;                
                break;          
        default:break;  
    }
}

/**
  @Summary
    Updates PWM Deadtime high register with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM Deadtime high register with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    deadtimeHigh    - Deadtime high value.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t deadtimeHigh;

    deadtimeHigh = 0x01;
    
    PWM_DeadTimeHighSet(PWM_GENERATOR_1, deadtimeHigh);
    </code>
*/  
inline static void PWM_DeadTimeHighSet(PWM_GENERATOR genNum, uint16_t deadtimeHigh)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                ALTDTR1 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_2:
                ALTDTR2 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_3:
                ALTDTR3 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_4:
                ALTDTR4 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_5:
                ALTDTR5 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_6:
                ALTDTR6 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_7:
                ALTDTR7 = deadtimeHigh;                
                break;   
        case PWM_GENERATOR_8:
                ALTDTR8 = deadtimeHigh;                
                break;   
        default:break;  
    }
}

/**
  @Summary
    Updates PWM Deadtime low and high register with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM Deadtime low and high register with the 
    requested value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    deadtimeHigh    - Deadtime value.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t deadtime;

    deadtime = 0x01;
    
    PWM_DeadTimeHighSet(PWM_GENERATOR_1, deadtime);
    </code>
*/  
inline static void PWM_DeadTimeSet(PWM_GENERATOR genNum, uint16_t deadtime)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                DTR1 = deadtime; 
                ALTDTR1 = deadtime;				
                break;   
        case PWM_GENERATOR_2:
                DTR2 = deadtime; 
                ALTDTR2 = deadtime;				
                break;   
        case PWM_GENERATOR_3:
                DTR3 = deadtime; 
                ALTDTR3 = deadtime;				
                break;   
        case PWM_GENERATOR_4:
                DTR4 = deadtime; 
                ALTDTR4 = deadtime;				
                break;   
        case PWM_GENERATOR_5:
                DTR5 = deadtime; 
                ALTDTR5 = deadtime;				
                break;   
        case PWM_GENERATOR_6:
                DTR6 = deadtime; 
                ALTDTR6 = deadtime;				
                break;   
        case PWM_GENERATOR_7:
                DTR7 = deadtime; 
                ALTDTR7 = deadtime;				
                break;   
        case PWM_GENERATOR_8:
                DTR8 = deadtime; 
                ALTDTR8 = deadtime;				
                break;   
        default:break;  
    }
}

/**
  @Summary
    Sets the PWM trigger compare value in count for the PWM Generator.

  @Description
    This routine is used to set the PWM trigger compare value in count 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    trigCompValue   - Trigger compare value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t trigCompValue;

    trigCompValue = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerCompareValueSet(genNum, trigCompValue);
    </code>
*/  
inline static void PWM_TriggerCompareValueSet(PWM_GENERATOR genNum, uint16_t trigCompValue)
{
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                TRIG1 = trigCompValue;               
                break;       
        case PWM_GENERATOR_2: 
                TRIG2 = trigCompValue;               
                break;       
        case PWM_GENERATOR_3: 
                TRIG3 = trigCompValue;               
                break;       
        case PWM_GENERATOR_4: 
                TRIG4 = trigCompValue;               
                break;       
        case PWM_GENERATOR_5: 
                TRIG5 = trigCompValue;               
                break;       
        case PWM_GENERATOR_6: 
                TRIG6 = trigCompValue;               
                break;       
        case PWM_GENERATOR_7: 
                TRIG7 = trigCompValue;               
                break;       
        case PWM_GENERATOR_8: 
                TRIG8 = trigCompValue;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Enables interrupt requests for the PWM Generator.

  @Description
    This routine is used to enable interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    
