MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    PWM_GeneratorInterruptEnable(genNum, interrupt);
    </code>
*/ 
inline static void PWM_GeneratorInterruptEnable(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON1bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON1bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON1bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_2:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON2bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON2bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON2bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_3:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON3bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON3bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON3bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_4:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON4bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON4bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON4bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_5:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON5bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON5bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON5bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_6:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON6bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON6bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON6bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_7:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON7bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON7bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON7bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_8:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON8bits.FLTIEN = true;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON8bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON8bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
}

/**
  @Summary
    Disables interrupt requests for the PWM Generator.

  @Description
    This routine is used to disables interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    PWM_GeneratorInterruptDisable(genNum, interrupt);
    </code>
*/ 
inline static void PWM_GeneratorInterruptDisable(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON1bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON1bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON1bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_2:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON2bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON2bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON2bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_3:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON3bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON3bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON3bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_4:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON4bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON4bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON4bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_5:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON5bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON5bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON5bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_6:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON6bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON6bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON6bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_7:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON7bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON7bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON7bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        case PWM_GENERATOR_8:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON8bits.FLTIEN = false;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON8bits.CLIEN = false;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON8bits.TRGIEN = false;
							break;							
					default:break;  
				}              
                break;  
        default:break;  
    }
}

/**
  @Summary
    Clears PWM interrupt status for the PWM Generator.

  @Description
    This routine is used to clear PWM interrupt status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    PWM_GeneratorEventStatusClear(genNum, interrupt);
    </code>
*/
inline static void PWM_GeneratorEventStatusClear(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON1bits.FLTIEN = false;
							PWMCON1bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON1bits.CLIEN = false;
							PWMCON1bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON1bits.TRGIEN = false;
							PWMCON1bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_2:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON2bits.FLTIEN = false;
							PWMCON2bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON2bits.CLIEN = false;
							PWMCON2bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON2bits.TRGIEN = false;
							PWMCON2bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_3:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON3bits.FLTIEN = false;
							PWMCON3bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON3bits.CLIEN = false;
							PWMCON3bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON3bits.TRGIEN = false;
							PWMCON3bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_4:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON4bits.FLTIEN = false;
							PWMCON4bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON4bits.CLIEN = false;
							PWMCON4bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON4bits.TRGIEN = false;
							PWMCON4bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_5:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON5bits.FLTIEN = false;
							PWMCON5bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON5bits.CLIEN = false;
							PWMCON5bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON5bits.TRGIEN = false;
							PWMCON5bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_6:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON6bits.FLTIEN = false;
							PWMCON6bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON6bits.CLIEN = false;
							PWMCON6bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON6bits.TRGIEN = false;
							PWMCON6bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_7:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON7bits.FLTIEN = false;
							PWMCON7bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON7bits.CLIEN = false;
							PWMCON7bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON7bits.TRGIEN = false;
							PWMCON7bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_8:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							PWMCON8bits.FLTIEN = false;
							PWMCON8bits.FLTIEN = true;							
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							PWMCON8bits.CLIEN = false;
							PWMCON8bits.CLIEN = true;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							PWMCON8bits.TRGIEN = false;
							PWMCON8bits.TRGIEN = true;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
}

/**
  @Summary
    Gets PWM interrupt status for the PWM Generator.

  @Description
    This routine is used to get PWM interrupt status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.
    interrupt - PWM generator interrupt source.

  @Returns
    true - Interrupt is pending.
	false - Interrupt is not pending.
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    PWM_GENERATOR_INTERRUPT interrupt;
    bool status;
    
    genNum = PWM_GENERATOR_1;
    interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
    status = PWM_GeneratorEventStatusGet(genNum, interrupt);
    </code>
*/
inline static bool PWM_GeneratorEventStatusGet(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
{
    bool status = false;
	
