MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
    switch(genNum) { 
        case PWM_GENERATOR_1:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON1bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON1bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON1bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_2:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON2bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON2bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON2bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_3:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON3bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON3bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON3bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_4:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON4bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON4bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON4bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_5:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON5bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON5bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON5bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_6:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON6bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON6bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON6bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_7:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON7bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON7bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON7bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_8:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON8bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON8bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON8bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
	return status;
}

/**
  @Summary
    Sets the compare value in count for the Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to set the compare value in count for the Special Event Trigger from the Primary time base generator.

  @Param
    compareValue - Compare value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t compareValue;

    compareValue = 0xFF;
    
    PWM_SpecialEventPrimaryCompareValueSet(compareValue);
    </code>
*/  
inline static void PWM_SpecialEventPrimaryCompareValueSet(uint16_t compareValue)
{
    SEVTCMP = compareValue;
}

/**
  @Summary
    Clears PWM Special Event Trigger interrupt request flag.

  @Description
    This routine is used to clear PWM Special Event Trigger interrupt request flag.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventTriggerInterruptFlagClear();
    </code>
*/ 
inline static void PWM_SpecialEventTriggerInterruptFlagClear(void)
{
    IFS3bits.PSEMIF = false;
}

/**
  @Summary
    Enables interrupt request for Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to enable interrupt request for Special Event Trigger from the Primary time base generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventPrimaryInterruptEnable();
    </code>
*/  
inline static void PWM_SpecialEventPrimaryInterruptEnable(void)
{
	PTCONbits.SEIEN = true; 
}

/**
  @Summary
    Disables interrupt request for Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to disable interrupt request for Special Event Trigger from the Primary time base generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventPrimaryInterruptDisable();
    </code>
*/  
inline static void PWM_SpecialEventPrimaryInterruptDisable(void)
{
	PTCONbits.SEIEN = false; 
}

/**
  @Summary
    Enables PWM latched fault mode for the PWM Generator.

  @Description
    This routine is used to enable PWM latched fault mode for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultModeLatchEnable(genNum);
    </code>
*/ 
inline static void PWM_FaultModeLatchEnable(PWM_GENERATOR genNum)
{
    uint16_t faultValue;
    
