MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
    switch(genNum) { 
        case PWM_GENERATOR_1:
                faultValue = ((FCLCON1 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON1, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_2:
                faultValue = ((FCLCON2 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON2, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_3:
                faultValue = ((FCLCON3 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON3, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_4:
                faultValue = ((FCLCON4 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON4, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_5:
                faultValue = ((FCLCON5 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON5, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_6:
                faultValue = ((FCLCON6 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON6, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_7:
                faultValue = ((FCLCON7 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON7, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_8:
                faultValue = ((FCLCON8 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON8, faultValue, &PWMKEY);
                break;       
        default:break;    
    }
}

/**
  @Summary
    Disables PWM latched fault mode for the PWM Generator selected by the 
    argument PWM_GENERATOR.

  @Description
    This routine is used to disable PWM latched fault mode for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultModeLatchDisable(genNum);
    </code>
*/  
inline static void PWM_FaultModeLatchDisable(PWM_GENERATOR genNum)
{
    uint16_t faultValue;
    
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                faultValue = ((FCLCON1 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON1, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_2: 
                faultValue = ((FCLCON2 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON2, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_3: 
                faultValue = ((FCLCON3 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON3, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_4: 
                faultValue = ((FCLCON4 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON4, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_5: 
                faultValue = ((FCLCON5 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON5, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_6: 
                faultValue = ((FCLCON6 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON6, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_7: 
                faultValue = ((FCLCON7 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON7, faultValue, &PWMKEY);
                break;       
        case PWM_GENERATOR_8: 
                faultValue = ((FCLCON8 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON8, faultValue, &PWMKEY);
                break;       
        default:break;   
    }   
}

/**
  @Summary
    Callback for PWM Special Event.

  @Description
    This routine is callback for PWM Special Event

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_SpecialEvent_CallBack();
    </code>
*/
void PWM_SpecialEvent_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_SpecialEvent_Tasks();
    </code>
    
*/
void PWM_SpecialEvent_Tasks(void);

/**
  @Summary
    Callback for PWM Generator1.

  @Description
    This routine is callback for PWM Generator1

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator1_CallBack();
    </code>
*/
void PWM_Generator1_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator1_Tasks();
    </code>   
*/
void PWM_Generator1_Tasks(void);

/**
  @Summary
    Callback for PWM Generator2.

  @Description
    This routine is callback for PWM Generator2

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator2_CallBack();
    </code>
*/
void PWM_Generator2_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator2_Tasks();
    </code>   
*/
void PWM_Generator2_Tasks(void);

/**
  @Summary
    Callback for PWM Generator3.

  @Description
    This routine is callback for PWM Generator3

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator3_CallBack();
    </code>
*/
void PWM_Generator3_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator3_Tasks();
    </code>   
*/
void PWM_Generator3_Tasks(void);

/**
  @Summary
    Callback for PWM Generator4.

  @Description
    This routine is callback for PWM Generator4

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator4_CallBack();
    </code>
*/
void PWM_Generator4_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator4_Tasks();
    </code>   
*/
void PWM_Generator4_Tasks(void);

/**
  @Summary
    Callback for PWM Generator5.

  @Description
    This routine is callback for PWM Generator5

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator5_CallBack();
    </code>
*/
void PWM_Generator5_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator5_Tasks();
    </code>   
*/
void PWM_Generator5_Tasks(void);

/**
  @Summary
    Callback for PWM Generator6.

  @Description
    This routine is callback for PWM Generator6

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator6_CallBack();
    </code>
*/
void PWM_Generator6_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator6_Tasks();
    </code>   
*/
void PWM_Generator6_Tasks(void);

/**
  @Summary
    Callback for PWM Generator7.

  @Description
    This routine is callback for PWM Generator7

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator7_CallBack();
    </code>
*/
void PWM_Generator7_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator7_Tasks();
    </code>   
*/
void PWM_Generator7_Tasks(void);

/**
  @Summary
    Callback for PWM Generator8.

  @Description
    This routine is callback for PWM Generator8

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator8_CallBack();
    </code>
*/
void PWM_Generator8_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator8_Tasks();
    </code>   
*/
void PWM_Generator8_Tasks(void);


