MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
/*******************************************************************************

  !!! Deprecated Definitions and APIs !!!
  !!! These functions will not be supported in future releases !!!

*******************************************************************************/

/** PWM Primary Synchronization Polarity Definition
 
 @Summary 
   Defines the PWM Primary Synchronization Input/Output Polarity.
 
 @Description
   This routine defines the PWM Primary Synchronization Input/Output Polarity.
 
 Remarks:
   None
 */
typedef enum 
{
    PWM_PRIMARY_SYNC_INOUT_POLARITY_HIGH,
    PWM_PRIMARY_SYNC_INOUT_POLARITY_LOW
} PWM_PRIMARY_SYNC_INOUT_POLARITY;

/**
  @Summary
    Sets the period value in count for the Primary Master Time Base generator.

  @Description
    This routine is used to set the period value in count for the Primary Master Time Base generator.

  @Param
    period - Period value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t period;

    period = 0xFF;
    
    PWM_PrimaryMasterPeriodSet(period);
    </code>
*/
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_MasterPeriodSet instead."))) PWM_PrimaryMasterPeriodSet(uint16_t period)
{
    PTPER = period;
}

/**
  @Summary
    Sets the period value in count for the PWM generator specific Time Base.

  @Description
    This routine is used to set the period value in count for the PWM generator specific Time Base.

  @Param
    genNum  - PWM generator number.
    period  - Period value in count.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t period;

    period = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_PeriodCenterAlignedModeSet(genNum, period);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_PeriodSet instead."))) PWM_PeriodCenterAlignedModeSet(PWM_GENERATOR genNum,uint16_t period)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                PHASE1 = period;                
                break;       
        case PWM_GENERATOR_2:
                PHASE2 = period;                
                break;       
        case PWM_GENERATOR_3:
                PHASE3 = period;                
                break;       
        case PWM_GENERATOR_4:
                PHASE4 = period;                
                break;       
        case PWM_GENERATOR_5:
                PHASE5 = period;                
                break;       
        case PWM_GENERATOR_6:
                PHASE6 = period;                
                break;       
        case PWM_GENERATOR_7:
                PHASE7 = period;                
                break;       
        case PWM_GENERATOR_8:
                PHASE8 = period;                
                break;       
        default:break;  
    }
}

/**
  @Summary
    Sets the PWM deadtime value in count for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to set the PWM deadtime value in count for the 
    PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum      - PWM generator number.
    deadtime    - Dead time value in count

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t deadtime;

    deadtime = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_DeadTimeCenterAlignedModeSet(genNum, deadtime);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_DeadTimeHighSet instead."))) PWM_DeadTimeCenterAlignedModeSet(PWM_GENERATOR genNum,uint16_t deadtime)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                ALTDTR1 = deadtime;                
                break;       
        case PWM_GENERATOR_2:
                ALTDTR2 = deadtime;                
                break;       
        case PWM_GENERATOR_3:
                ALTDTR3 = deadtime;                
                break;       
        case PWM_GENERATOR_4:
                ALTDTR4 = deadtime;                
                break;       
        case PWM_GENERATOR_5:
                ALTDTR5 = deadtime;                
                break;       
        case PWM_GENERATOR_6:
                ALTDTR6 = deadtime;                
                break;       
        case PWM_GENERATOR_7:
                ALTDTR7 = deadtime;                
                break;       
        case PWM_GENERATOR_8:
                ALTDTR8 = deadtime;                
                break;       
        default:break;  
    }
}

/**
  @Summary
    Clears PWM interupt request flag for the PWM Generator selected by 
    the argument PWM_GENERATOR.

  @Description
    This routine is used to clear PWM interupt request flag for the 
    PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_InterruptFlagClear(genNum);
    </code>
*/ 
inline static void __attribute__((deprecated)) PWM_InterruptFlagClear(PWM_GENERATOR genNum)
{	
    switch(genNum) { 
        case PWM_GENERATOR_1:
                IFS5bits.PWM1IF = false;                 
                break;       
        case PWM_GENERATOR_2:
                IFS5bits.PWM2IF = false;                 
                break;       
        case PWM_GENERATOR_3:
                IFS6bits.PWM3IF = false;                 
                break;       
        case PWM_GENERATOR_4:
                IFS6bits.PWM4IF = false;                 
                break;       
        case PWM_GENERATOR_5:
                IFS6bits.PWM5IF = false;                 
                break;       
        case PWM_GENERATOR_6:
                IFS6bits.PWM6IF = false;                 
                break;       
        case PWM_GENERATOR_7:
                IFS6bits.PWM7IF = false;                 
                break;       
        case PWM_GENERATOR_8:
                IFS6bits.PWM8IF = false;                 
                break;       
        default:break;    
    }
}

/**
  @Summary
    Enables the PWM module.

  @Description
    This routine is used to enable the PWM module.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_ModuleEnable();
    </code>
*/
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_Enable instead."))) PWM_ModuleEnable(void)
{
	PTCONbits.PTEN = true; 
}

/**
  @Summary
    Disables the PWM module.

  @Description
    This routine is used to disable the PWM module.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_ModuleDisable();
    </code>
*/
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_Disable instead."))) PWM_ModuleDisable(void)
{
	PTCONbits.PTEN = false; 
}

/**
  @Summary
    Sets the PWM trigger output divider value in count for the 
    PWM Generator selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to set the PWM trigger output divider value in count 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    trigDivValue    - Trigger value value in count

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t trigDivValue;

    trigDivValue = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerDividerSet(genNum, trigDivValue);
    </code>
*/  
inline static void __attribute__((deprecated)) PWM_TriggerDividerSet(PWM_GENERATOR genNum,uint16_t trigDivValue)
{
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                TRGCON1bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_2: 
                TRGCON2bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_3: 
                TRGCON3bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_4: 
                TRGCON4bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_5: 
                TRGCON5bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_6: 
                TRGCON6bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_7: 
                TRGCON7bits.TRGDIV = trigDivValue;               
                break;       
        case PWM_GENERATOR_8: 
                TRGCON8bits.TRGDIV = trigDivValue;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Sets the PWM trigger start delay value in count for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to set the PWM trigger start delay value in count
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum      - PWM generator number.
    delayValue  - Trigger start delay value in count

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    uint16_t delayValue;

    delayValue = 0x01;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerStartDelaySet(genNum, delayValue);
    </code>
*/  
inline static void __attribute__((deprecated)) PWM_TriggerStartDelaySet(PWM_GENERATOR genNum,uint16_t delayValue)
{
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                TRGCON1bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_2: 
                TRGCON2bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_3: 
                TRGCON3bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_4: 
                TRGCON4bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_5: 
                TRGCON5bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_6: 
                TRGCON6bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_7: 
                TRGCON7bits.TRGSTRT = delayValue;               
                break;       
        case PWM_GENERATOR_8: 
                TRGCON8bits.TRGSTRT = delayValue;               
                break;       
        default:break;  
    }
}

/**
  @Summary
   Sets the postscaler value for the PWM special event trigger from the Primary time base generator.

  @Description
    This routine is used to set the postscaler value for the PWM special event trigger from the Primary time base generator.

  @Param
    postscaler - Special event postscaler value.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t postscaler;

    postscaler = 0xFF;

    PWM_SpecialEventPrimaryPostscalerSet(postscaler);
    </code>
*/  
inline static void __attribute__((deprecated)) PWM_SpecialEventPrimaryPostscalerSet(uint16_t postscaler)
{
    PTCONbits.SEVTPS = postscaler;
}

/**
  @Summary
    Enables synchronization output from the Primary PWM timebase generator.

  @Description
    This routine is used to enable synchronization output from the Primary PWM timebase generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_PrimarySyncOutputEnable();
    </code>
*/ 
inline static void __attribute__((deprecated)) PWM_PrimarySyncOutputEnable(void)
{
    PTCONbits.SYNCOEN = true; 
}

/**
  @Summary
    Disables synchronization output from the Primary PWM timebase generator.

  @Description
    This routine is used to disable synchronization output from the Primary PWM timebase generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_PrimarySyncOutputDisable();
    </code>
*/  
inline static void __attribute__((deprecated)) PWM_PrimarySyncOutputDisable(void)
{
    PTCONbits.SYNCOEN = false; 
}

/**
  @Summary
    Assigns the primary synchronization input/output polarity.

  @Description
    This routine is used to assign the primary synchronization input/output polarity.

  @Param
    polarity    -   Polarity to be set.

  @Returns
    None
 
  @Example 
    <code>    
        PWM_PRIMARY_SYNC_INOUT_POLARITY polarity = PWM_PRIMARY_SYNC_INOUT_POLARITY_LOW;
        PWM_PrimarySyncInputOutputPolaritySet(polarity);
    </code>
*/
inline static void __attribute__((deprecated)) PWM_PrimarySyncInputOutputPolaritySet(PWM_PRIMARY_SYNC_INOUT_POLARITY polarity)
{
    PTCONbits.SYNCPOL = polarity;
}

/**
  @Summary
    Clears PWM fault status for the PWM Generator selected by the 
    argument PWM_GENERATOR.

  @Description
    This routine is used to clear PWM fault status for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultInterruptStatusClear(genNum);
    </code>
*/ 
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEventStatusClear instead."))) PWM_FaultInterruptStatusClear(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                PWMCON1bits.FLTIEN = false;
                PWMCON1bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_2:
                PWMCON2bits.FLTIEN = false;
                PWMCON2bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_3:
                PWMCON3bits.FLTIEN = false;
                PWMCON3bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_4:
                PWMCON4bits.FLTIEN = false;
                PWMCON4bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_5:
                PWMCON5bits.FLTIEN = false;
                PWMCON5bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_6:
                PWMCON6bits.FLTIEN = false;
                PWMCON6bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_7:
                PWMCON7bits.FLTIEN = false;
                PWMCON7bits.FLTIEN = true;                
                break;       
        case PWM_GENERATOR_8:
                PWMCON8bits.FLTIEN = false;
                PWMCON8bits.FLTIEN = true;                
                break;       
        default:break;    
    }
}

/**
  @Summary
    Gets PWM fault status for the PWM Generator selected by the 
    argument PWM_GENERATOR.

  @Description
    This routine is used to get PWM fault status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    Fault interrupt status value.
 
  @Example 
    <code>    
    bool status;
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    status = PWM_FaultInterruptStatusGet(genNum);
    </code>
*/ 
inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEventStatusGet instead."))) PWM_FaultInterruptStatusGet(PWM_GENERATOR genNum)
{
    bool status = false;
    switch(genNum) { 
        case PWM_GENERATOR_1:
                status = PWMCON1bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_2:
                status = PWMCON2bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_3:
                status = PWMCON3bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_4:
                status = PWMCON4bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_5:
                status = PWMCON5bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_6:
                status = PWMCON6bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_7:
                status = PWMCON7bits.FLTSTAT;                
                break;       
        case PWM_GENERATOR_8:
                status = PWMCON8bits.FLTSTAT;                
                break;       
        default:break;    
    }
    return status;
}

/**
  @Summary
    Enables fault event interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to enable fault event interrupt requests 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultInterruptEnable(genNum);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorInterruptEnable instead."))) PWM_FaultInterruptEnable(PWM_GENERATOR genNum)
{	
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                PWMCON1bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_2: 
                PWMCON2bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_3: 
                PWMCON3bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_4: 
                PWMCON4bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_5: 
                PWMCON5bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_6: 
                PWMCON6bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_7: 
                PWMCON7bits.FLTIEN = true;               
                break;       
        case PWM_GENERATOR_8: 
                PWMCON8bits.FLTIEN = true;               
                break;       
        default:break;  
    } 
}

/**
  @Summary
    Disables fault event interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to disable fault event interrupt requests 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultInterruptDisable(genNum);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorInterruptDisable instead."))) PWM_FaultInterruptDisable(PWM_GENERATOR genNum)
{	
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                PWMCON1bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_2: 
                PWMCON2bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_3: 
                PWMCON3bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_4: 
                PWMCON4bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_5: 
                PWMCON5bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_6: 
                PWMCON6bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_7: 
                PWMCON7bits.FLTIEN = false;               
                break;       
        case PWM_GENERATOR_8: 
                PWMCON8bits.FLTIEN = false;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Clears PWM current limit status for the PWM Generator selected 
    by the argument PWM_GENERATOR.

  @Description
    This routine is used to clear PWM current limit status 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_CurrentLimitInterruptStatusClear(genNum);
    </code>
*/ 
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEventStatusClear instead."))) PWM_CurrentLimitInterruptStatusClear(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                PWMCON1bits.CLIEN = false;
                PWMCON1bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_2:
                PWMCON2bits.CLIEN = false;
                PWMCON2bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_3:
                PWMCON3bits.CLIEN = false;
                PWMCON3bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_4:
                PWMCON4bits.CLIEN = false;
                PWMCON4bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_5:
                PWMCON5bits.CLIEN = false;
                PWMCON5bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_6:
                PWMCON6bits.CLIEN = false;
                PWMCON6bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_7:
                PWMCON7bits.CLIEN = false;
                PWMCON7bits.CLIEN = true;                
                break;       
        case PWM_GENERATOR_8:
                PWMCON8bits.CLIEN = false;
                PWMCON8bits.CLIEN = true;                
                break;       
        default:break;    
    }
}

/**
  @Summary
    Gets PWM current limit status for the PWM Generator selected 
    by the argument PWM_GENERATOR.

  @Description
    This routine is used to get PWM current limit status 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    Current Limit interrupt status value.
 
  @Example 
    <code>    
    bool status;
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    status = PWM_CurrentLimitInterruptStatusGet(genNum);
    </code>
*/  
inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEventStatusGet instead."))) PWM_CurrentLimitInterruptStatusGet(PWM_GENERATOR genNum)
{	
    bool status = false;
    switch(genNum) { 
        case PWM_GENERATOR_1:
                status = PWMCON1bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_2:
                status = PWMCON2bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_3:
                status = PWMCON3bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_4:
                status = PWMCON4bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_5:
                status = PWMCON5bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_6:
                status = PWMCON6bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_7:
                status = PWMCON7bits.CLSTAT;                
                break;       
        case PWM_GENERATOR_8:
                status = PWMCON8bits.CLSTAT;                
                break;       
        default:break;   
    }
    return status;
}

/**
  @Summary
    Enables current limit interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

