MicrochipTommyChen/PowerClickBoard/dsPIC33EP128GS806.X/mcc_generated_files/pwm.h
  @Description
    This routine is used to enable current limit interrupt requests 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_CurrentLimitInterruptEnable(genNum);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorInterruptEnable instead."))) PWM_CurrentLimitInterruptEnable(PWM_GENERATOR genNum)
{	
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                PWMCON1bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_2: 
                PWMCON2bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_3: 
                PWMCON3bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_4: 
                PWMCON4bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_5: 
                PWMCON5bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_6: 
                PWMCON6bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_7: 
                PWMCON7bits.CLIEN = true;               
                break;       
        case PWM_GENERATOR_8: 
                PWMCON8bits.CLIEN = true;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Disables current limit interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to disable current limit interrupt requests 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_CurrentLimitInterruptDisable(genNum);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorInterruptDisable instead."))) PWM_CurrentLimitInterruptDisable(PWM_GENERATOR genNum)
{	
     switch(genNum) { 
        case PWM_GENERATOR_1: 
                PWMCON1bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_2: 
                PWMCON2bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_3: 
                PWMCON3bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_4: 
                PWMCON4bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_5: 
                PWMCON5bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_6: 
                PWMCON6bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_7: 
                PWMCON7bits.CLIEN = false;               
                break;       
        case PWM_GENERATOR_8: 
                PWMCON8bits.CLIEN = false;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Clears PWM trigger status for the PWM Generator selected by the 
    argument PWM_GENERATOR.

  @Description
    This routine is used to clear PWM trigger status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerInterruptStatusClear(genNum);
    </code>
*/ 
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEventStatusClear instead."))) PWM_TriggerInterruptStatusClear(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                PWMCON1bits.TRGIEN = false;
                PWMCON1bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_2:
                PWMCON2bits.TRGIEN = false;
                PWMCON2bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_3:
                PWMCON3bits.TRGIEN = false;
                PWMCON3bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_4:
                PWMCON4bits.TRGIEN = false;
                PWMCON4bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_5:
                PWMCON5bits.TRGIEN = false;
                PWMCON5bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_6:
                PWMCON6bits.TRGIEN = false;
                PWMCON6bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_7:
                PWMCON7bits.TRGIEN = false;
                PWMCON7bits.TRGIEN = true;                
                break;       
        case PWM_GENERATOR_8:
                PWMCON8bits.TRGIEN = false;
                PWMCON8bits.TRGIEN = true;                
                break;       
        default:break;    
    }
}

/**
  @Summary
    Gets PWM trigger status for the PWM Generator selected by the argument 
    PWM_GENERATOR.

  @Description
    This routine is used to get PWM trigger status for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    Trigger interrupt status value.
 
  @Example 
    <code>    
    bool status;
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    status = PWM_TriggerInterruptStatusGet(genNum);
    </code>
*/  
inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEventStatusGet instead."))) PWM_TriggerInterruptStatusGet(PWM_GENERATOR genNum)
{
    bool status = false;
    switch(genNum) { 
        case PWM_GENERATOR_1:
                status = PWMCON1bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_2:
                status = PWMCON2bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_3:
                status = PWMCON3bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_4:
                status = PWMCON4bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_5:
                status = PWMCON5bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_6:
                status = PWMCON6bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_7:
                status = PWMCON7bits.TRGSTAT;                
                break;       
        case PWM_GENERATOR_8:
                status = PWMCON8bits.TRGSTAT;                
                break;       
        default:break;  
    }
    return status;
}

/**
  @Summary
    Enables trigger event interrupt requests for the PWM Generator 
    selected by the argument PWM_GENERATOR.

  @Description
    This routine is used to enable trigger event interrupt requests 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerInterruptEnable(genNum);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorInterruptEnable instead."))) PWM_TriggerInterruptEnable(PWM_GENERATOR genNum)
{	
     switch(genNum) { 
        case PWM_GENERATOR_1: 
                PWMCON1bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_2: 
                PWMCON2bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_3: 
                PWMCON3bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_4: 
                PWMCON4bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_5: 
                PWMCON5bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_6: 
                PWMCON6bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_7: 
                PWMCON7bits.TRGIEN = true;               
                break;       
        case PWM_GENERATOR_8: 
                PWMCON8bits.TRGIEN = true;               
                break;       
        default:break;  
    }
}

/**
  @Summary
    Disables trigger event interrupt requests for the PWM Generator.

  @Description
    This routine is used to disable trigger event interrupt requests 
    for the PWM Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_TriggerInterruptDisable(genNum);
    </code>
*/  
inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorInterruptDisable instead."))) PWM_TriggerInterruptDisable(PWM_GENERATOR genNum)
{	
     switch(genNum) { 
        case PWM_GENERATOR_1: 
                PWMCON1bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_2: 
                PWMCON2bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_3: 
                PWMCON3bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_4: 
                PWMCON4bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_5: 
                PWMCON5bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_6: 
                PWMCON6bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_7: 
                PWMCON7bits.TRGIEN = false;               
                break;       
        case PWM_GENERATOR_8: 
                PWMCON8bits.TRGIEN = false;               
                break;       
        default:break;  
    }
}

#ifdef __cplusplus  // Provide C++ Compatibility

    }

#endif

#endif //_PWM_H
    
/**
 End of File
*/
